Feature: Търсене на животно


  Scenario: Търсене на животво със несъществуващо ID
    Given Потребителя отваря екрана за търсене
    When въведе ID "1" 
    And натисне бутона търесене
    Then Вижда съобщение: "Животно с това ID несъществува!"

 Scenario: Търсене на животво със съществуващо ID
    Given Потребителя отваря екрана за търсене
    When въведе ID "2"
    And натисне бутона търесене
    Then Вижда съобщение: "Името на това животно е: Mimi"

 Scenario: Търсене на животно по име
	Given Потребителя отваря екрана за търсене
	When Въведе име : "Mimi" в полето за име
	And натисне бутона търесене
	Then Вижда съобщение: "Има 2 крави с това име - тяхните ID са: 2; 3; "
	
	Scenario: Търсене на животно по име
	Given Потребителя отваря екрана за търсене
	When Въведе име : "Mika" в полето за име
	And натисне бутона търесене
	Then Вижда съобщение: "Няма крави с това име!"